name: "llama3"
backend: "vllm"
max_batch_size: 0

model_transaction_policy {
  decoupled: true
}

input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
  {
    kind: KIND_MODEL
  }
]
